keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h



#ifndef ATMEGA32_LIB_H
#define ATMEGA32_LIB_H

typedef unsigned char U8;
typedef unsigned short U16;
typedef unsigned long U32;

/*
							   *************
******************************** GPIO, DIO *****************************
							   *************
*/
/*
** The DDxn bit in the DDRx Register selects the direction of this pin. If DDxn is written logic one, Pxn is configured as an output pin. 
** If DDxn is written logic zero, Pxn is configured as an input pin. 
** If PORTxn is written logic one when the pin is configured as an input pin, the pull-up resistor is activated.
** To switch the pull-up resistor off, PORTxn has to be written logic zero or the pin has to be configured as an output pin.
*/

#define INPUT				0x00
#define OUTPUT				0x01
#define TRUE_DIR(dir)		(dir==INPUT||dir==OUTPUT)

/* Port A */
#define PINA	*(volatile U8 *const)0x39
#define DDRA	*(volatile U8 *const)0x3A
#define PORTA	*(volatile U8 *const)0x3B
/* Port B */
#define PINB	*(volatile U8 *const)0x36
#define DDRB	*(volatile U8 *const)0x37
#define PORTB	*(volatile U8 *const)0x38
/* Port C */
#define PINC	*(volatile U8 *const)0x33
#define DDRC	*(volatile U8 *const)0x34
#define PORTC	*(volatile U8 *const)0x35
/* Port D */
#define PIND	*(volatile U8 *const)0x30
#define DDRD	*(volatile U8 *const)0x31
#define PORTD	*(volatile U8 *const)0x32

/* 
** second way for simplicity in GPIO Driver 
*/
#define A		0x39
#define B		0x36
#define C		0x33
#define D		0x30

#define TRUE_PORT(port_base)	(port_base==0x39||port_base==0x36||port_base==0x33||port_base==0x30)
#define TRUE_PIN(pin)			(pin>=0&&pin<=7)

#define DDR(port_base)	*((volatile U8 *const)(port_base+0x01))
#define PORT(port_base)	*((volatile U8 *const)(port_base+0x02))
#define PIN(port_base)	*((volatile U8 *const)(port_base+0x00))


/*
** About PIN_INT0 & PIN_INT1 & PIN_INT2: if enabled it will be serve interrupt as input even if it was setted output in GPIO.
*/
/********** 7 **********/
#define PIN_OC2		7
#define PIN_SCK		7
#define PIN_ADC7	7
#define PIN_TOSC2	7
/********** 6 **********/
#define PIN_MISO	6
#define PIN_ADC6	6
#define PIN_TOSC1	6
#define PIN_ICP1	6
/********** 5 **********/
#define PIN_MOSI	5
#define PIN_TDI		5
#define PIN_ADC5	5
#define PIN_OC1A	5
/********** 4 **********/
#define PIN_ADC4	4
#define PIN_TDO		4
#define PIN_OC1B	4
#define PIN_SS		4
/********** 3 **********/
#define PIN_INT1	3
#define PIN_TMS		3
#define PIN_AIN1	3
#define PIN_OC0		3
#define PIN_ADC3	3
/********** 2 **********/
#define PIN_INT0	2
#define PIN_TCK		2
#define PIN_AIN0	2	
#define PIN_T2		2
#define PIN_ADC2	2
/********** 1 **********/
#define PIN_TXD		1
#define PIN_SDA		1
#define PIN_T1		1
#define PIN_ADC1	1
/********** 0 **********/
#define PIN_RXD		0
#define PIN_SCL		0
#define PIN_XCK		0
#define PIN_T0		0
#define PIN_ADC0	0


#define SET_BIT(reg,pin)		reg|=(1<<pin)
#define CLR_BIT(reg,pin)		reg&=~(1<<pin)
#define READ_BIT(reg,pin)		((reg&(1<<pin))>>pin)
#define TOGGLE_BIT(reg,pin)		reg^=(1<<pin)

/*
			    *************************
***************************** CPU special registers *******************************
 			    *************************
*/
/* CPU stack pointer high */
#define SPL *(volatile U8 *const)0x5D
#define SP8	 0
#define SP9  1
#define SP10 2
#define SP11 3

/* CPU stack pointer low */
#define SPH *(volatile U8 *const)0x5E
#define SP0 0
#define SP1 1
#define SP2 2
#define SP3 3
#define SP4 4
#define SP5 5
#define SP6 6
#define SP7 7

/* 
** status register
*/
#define SREG *(volatile U8 *const)0x5F
/*
** C: Carry Flag
*/
#define C_carry 0
#define c 0
/*
** Z: Zero Flag
*/
#define Z 1
/*
** N: Negative Flag
*/
#define N 2
/*
** V: Two’s Complement Overflow Flag
*/
#define V 3
/*
** S: Sign Bit, S = N ⊕ V
*/
#define S 4
/*
** H: Half Carry Flag
*/
#define H 5
/*
** T: Bit Copy Storage
*/
#define T 6
/*
** I: Global Interrupt Enable
*/
#define I 7

#define Active_Global_INT()	SET_BIT(SREG,I)

/*
			       ***********************************
******************************** Interrupts, External Interrupts.*************************************
			       ***********************************
*/
/* 
** general interrupt control register.
** External Interrupts control in MCU Control Register"MCUCR"
*/
#define GICR *(volatile U8 *const)0x5B
/*
** iInterrupt vector change enable.
** must be written to logic one to enable change of the IVSEL bit.
** is cleared by hardware four cycles after it is written or when IVSEL is written.
** 
*/
#define IVCE 	0
/*
** interrupt vector select
** clear(zero), the Interrupt Vectors are placed at the start of the Flash memory.
** set (one), the Interrupt Vectors are moved to the beginning of the Boot Loader section of the Flash.
** The actual address of the start of the boot Flash section is determined by the BOOTSZ Fuses.
** a special write procedure must be followed to change the IVSEL bit:
** (1) Write the Interrupt Vector Change Enable (IVCE) bit to one.
** (2) Within four cycles, write the desired value to IVSEL while writing a zero to IVCE.
** Interrupts are disabled in the cycle IVCE is set, and they remain disabled until after the instruction following the write to IVSEL. 
** If IVSEL is not written, interrupts remain disabled for four cycles.
*/
#define IVSEL	1
/*
** INT2: External Interrupt Request 2 Enable
** When the INT2 bit is set (one) and the I-bit in the Status Register (SREG) is set (one), the external pin interrupt is enabled.
** Activity on the pin will cause an interrupt request even if INT2 is configured as an output
*/
#define INT2	5
/*
** INT0: External Interrupt Request 0 Enable.
** When the INT0 bit is set (one) and the I-bit in the Status Register (SREG) is set (one), the external pin interrupt is enabled.
** Activity on the pin will cause an interrupt request even if INT0 is configured as an output.
*/
#define INT0	6
/*
** INT1: External Interrupt Request 1 Enable
** When the INT1 bit is set (one) and the I-bit in the Status Register (SREG) is set (one), the external pin interrupt is enabled.
** Activity on the pin will cause an interrupt request even if INT1 is configured as an output.
*/
#define INT1	7
/**********************************
** General Interrupt Flag Register.
*/
#define GIFR *(volatile U8 *const)0x5A
/*
** INTF1: External Interrupt Flag 1
** When an event on the INT1 pin triggers an interrupt request, INTF1 becomes set (one).
** If the I-bit in SREG and the INT1 bit in GICR are set (one), the MCU will jump to the corresponding Interrupt Vector.
** The flag is cleared when the interrupt routine is executed. Alternatively, the flag can be cleared by writing a logical one to it.
*/
#define INTF1	7
/*
** INTF0: External Interrupt Flag 0
** When an event on the INT0 pin triggers an interrupt request, INTF0 becomes set (one).
** If the I-bit in SREG and the INT0 bit in GICR are set (one), the MCU will jump to the corresponding Interrupt Vector.
** The flag is cleared when the interrupt routine is executed. Alternatively, the flag can be cleared by writing a logical one to it.
*/
#define INTF0	6
/*
** INTF2: External Interrupt Flag 2
** When an event on the INT2 pin triggers an interrupt request, INTF0 becomes set (one).
** If the I-bit in SREG and the INT2 bit in GICR are set (one), the MCU will jump to the corresponding Interrupt Vector.
** The flag is cleared when the interrupt routine is executed. Alternatively, the flag can be cleared by writing a logical one to it.
** Note that when entering some sleep modes with the INT2 interrupt disabled.
*/
#define INTF2	5
/*
			       ******************************************************
******************************** MCU Power management & External Interrupts control *************************************
			       ******************************************************
*/
/*
** MCU Control Register, contains control bits for power management.
*/
#define MCUCR *(volatile U8 *const)0x55
/*
** set(one) to make the MCU enter the sleep mode when the SLEEP instruction is executed.
*/
#define SE  7
/*
** Power control.
** SM2, SM1, SM0 = { 000 to Idle Mode, 
**					 001 ADC noise Reduction Mode,
**					 010 Power-down Mode,
**                   011 Power-Save Mode,
** 					 110 Standby Mode,
**					 111 Extended Standby Mode }
*/
#define SM0 4
#define SM1 5
#define SM2 6
/***
** External Interrupts control
** Ext interrupt2 INT2 controlled from ISC2 in MCUCSR Bit6.
****
** ISC0n: Interrupt Sense Control 0 Bit 1 and Bit 0 [n = 1:0]
** ISC01, ISC00 = { 00: The low level of INT0 generates an interrupt request,
**					01: Any logical change on INT0 generates an interrupt request,
**					10: The falling edge of INT0 generates an interrupt request,
**					11: The rising edge of INT0 generates an interrupt request  }
*/
#define ISC00	0
#define ISC01	1
/*
** ISC1n: Interrupt Sense Control 1 Bit 1 and Bit 0 [n = 1:0]
** ISC11, ISC10 = { 00: The low level of INT1 generates an interrupt request,
**					01: Any logical change on INT1 generates an interrupt request,
**					10: The falling edge of INT1 generates an interrupt request,
**					11: The rising edge of INT1 generates an interrupt request }
*/
#define ISC10	2
#define ISC11	3

