keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
/*
			       *********************************************************
******************************** MCU Rset Control & Ext INT2 control & jTAG En/Disable *************************************
			       *********************************************************
*/
/*
************************************************************************
** MCU Control and status register, provides information on which reset source caused an MCU Reset.
*/
#define MCUCSR *(volatile U8 *const)0x54
/*
** PORF: Power-on Reset Flag
** This bit is set if a Power-on Reset occurs. The bit is reset only by writing a logic zero to the flag. To make
** use of the Reset Flags to identify a reset condition, the user should read and then reset the MCUCSR as
** early as possible in the program. If the register is cleared before another reset occurs, the source of the
** reset can be found by examining the Reset Flags.
*/
#define PORF	0
/*
** EXTRF: External Reset Flag
** This bit is set if an External Reset occurs. The bit is reset by a Power-on Reset, or by writing a logic zero to the flag.
*/
#define EXTRF	1
/*
** BORF: Brown-out Reset Flag
** This bit is set if a Brown-out Reset occurs. The bit is reset by a Power-on Reset, or by writing a logic zero to the flag.
*/
#define BORF	2
/*
** WDRF: Watchdog Reset Flag.
** This bit is set if a Watchdog Reset occurs. The bit is reset by a Power-on Reset, or by writing a logic zero to the flag.
*/
#define WDRF	3
/*
** JTRF: JTAG Reset Flag.
** This bit is set if a reset is being caused by a logic one in the JTAG Reset Register selected by the JTAG
** instruction AVR_RESET. This bit is reset by a Power-on Reset, or by writing a logic zero to the flag.
*/
#define JTRF	4
/*
** JTD: JTAG Interface Disable.
** When this bit is zero, the JTAG interface is enabled if the JTAGEN fuse is programmed.
** If this bit is one, the JTAG interface is disabled.
** In order to avoid unintentional disabling or enabling of the JTAG interface, a timed sequence must be followed when changing this bit:>>
** >> The application software must write this bit to the desired value twice within four cycles to change its value.
** >> If the JTAG interface is left unconnected to other JTAG circuitry, the JTD bit should be set to one. The reason for 
** this is to avoid static current at the TDO pin in the JTAG interface.
*/
#define JTD		7
/*
** CONTRO EXTERNAL INTERRUPT INT2
** ISC2: Interrupt Sense Control 2, for External Interrupt 2.
** The Asynchronous External Interrupt 2 is activated by the external pin INT2,
** if the SREG I-bit and the corresponding interrupt mask in GICR are set
** If ISC2 is written to (zero), a falling edge on INT2 activates the interrupt.
** If ISC2 is written to (one), a rising edge on INT2 activates the interrupt.
** When changing the ISC2 bit, an interrupt can occur. Therefore, it is recommended to first disable INT2 by clearing its
** Interrupt Enable bit in the GICR Register. Then, the ISC2 bit can be changed.
*/
#define ISC2	6
/*
			       ***************************************
******************************** The Oscillator Calibration Register ******************************
			       ***************************************
*/
/*
** OSCCAL: The Oscillator Calibration Register.
** Oscillator Calibration Value [n = 7:0]
** Read page 47 on latest data sheet.
*/
#define OSCCAL	*(volatile U8 *const)0x51
#define CAL0	0
#define CAL1	1
#define CAL2	2
#define CAL3	3
#define CAL4	4
#define CAL5	5
#define CAL6	6
#define CAL7	7
/*
			       ********************
******************************** On-Chip debugger ******************************
			       ********************
*/
/*
** OCDR: On-Chip debugger 
** The OCDR Register provides a communication channel from the running program in the microcontroller
** to the debugger. The CPU can transfer a byte to the debugger by writing to this location. At the same
** time, an internal flag; I/O Debug Register Dirty – IDRD – is set to indicate to the debugger that the register has been written.
*/
#define OCDR	*(volatile U8 *const)0x51

#define OCDR0	0
#define OCDR1 	1
#define OCDR2	2
#define OCDR3	3
#define OCDR4	4
#define OCDR5	5
#define OCDR6	6
#define OCDR7	7
/*
** IDRD: I/O Debug Register Dirty
** When the CPU reads the OCDR Register the 7 LSB will be from the OCDR Register, while the MSB is the IDRD bit.
** An internal flag, is set(one) to indicate to the debugger that the register has been written.
** The debugger clears(zero) the IDRD bit when it has read the information.
*/
#define IDRD	7
/*
			       *****************************************
******************************** Store Program Memory Control Register ******************************
			       *****************************************
*/
/*
** SPMCR – Store Program Memory Control Register
** 
*/
#define SPMCR	*(volatile U8 *const)0x57
/*
** SPMEN: Store Program Memory.
** This bit enables the SPM instruction for the next four clock cycles. If written to one together with eitherRWWSRE, 
** BLBSET, PGWRT or PGERS, the following SPM instruction will have a special meaning, see description in page 327.
** If only SPMEN is written, the following SPM instruction will store the value in R1:R0 in the temporary page buffer addressed by the Z-pointer.
** The LSB of the Z-pointer is ignored. The SPMEN bit will auto-clear upon completion of an SPM instruction,
** or if no SPM instruction is executed within four clock cycles. During Page Erase and Page Write, 
** the SPMEN bit remains high until the operation is completed.
** Writing any other combination than “10001”, “01001”, “00101”, “00011” or “00001” in the lower five bits will have no effect.
*/
#define SPMEN	0
/*
** PGERS: Page Erase.
** If this bit is written to one at the same time as SPMEN, the next SPM instruction within four clock cycles executes Page Erase.
** The page address is taken from the high part of the Z-pointer. The data in R1 and R0 are ignored.
** The PGERS bit will auto-clear upon completion of a Page Erase, or if no SPM instruction is executed within four clock cycles.
** The CPU is halted during the entire Page Write operation if the NRWW section is addressed.
*/
#define PGERS	1
/*
** PGWRT: Page Write
** If this bit is written to one at the same time as SPMEN, the next SPM instruction within four clock cycles executes Page Write, 
** with the data stored in the temporary buffer. The page address is taken from the high part of the Zpointer. The data in R1 and R0 are ignored.
** The PGWRT bit will auto-clear upon completion of a Page Write, or if no SPM instruction is executed within four clock cycles.
** The CPU is halted during the entire Page Write operation if the NRWW section is addressed.
*/
#define PGWRT	2
/*
** BLBSET: Boot Lock Bit Set.
** If this bit is written to one at the same time as SPMEN, the next SPM instruction within four clock cycles 
** sets Boot Lock bits, according to the data in R0. The data in R1 and the address in the Z-pointer are ignored.
** The BLBSET bit will automatically be cleared upon completion of the Lock bit set, or if no SPM 
** instruction is executed within four clock cycles.
** An LPM instruction within three cycles after BLBSET and SPMEN are set in the SPMCR Register(SPMCR.BLBSET and SPMCR.SPMEN), 
** will read either the Lock bits or the Fuse bits (depending on Z0 in the Z-pointer) into the destination register.
*/
#define BLBSET	3
/*
** RWWSRE: Read-While-Write Section Read Enable
** When programming (Page Erase or Page Write) to the RWW section, the RWW section is blocked for reading (the RWWSB will be set by hardware).
** To re-enable the RWW section, the user software must wait until the programming is completed (SPMEN will be cleared).
** Then, if the RWWSRE bit is written to one at the same time as SPMEN, the next SPM instruction within 
** four clock cycles re-enables the RWW section.
** The RWW section cannot be re-enabled while the Flash is busy with a Page Erase or a Page Write (SPMEN is set).
** If the RWWSRE bit is written while the Flash is being loaded, the Flash load operation will abort and the data loaded will be lost.
*/
#define RWWSRE	4
/*
** RWWSB: Read-While-Write Section Busy.
** When a Self-Programming (page erase or page write) operation to the RWW section is initiated, the RWWSB will be set (one) by hardware.
** When the RWWSB bit is set, the RWW section cannot be accessed.
** The RWWSB bit will be cleared if the RWWSRE bit is written to one after a Self-Programming operation is completed.
*/
#define RWWSB	6
/*
** SPMIE: SPM Interrupt Enable.
** When the SPMIE bit is written to one, and the I-bit in the Status Register is set (one), the SPM ready interrupt will be enabled.
** The SPM ready Interrupt will be executed as long as the SPMEN bit in the SPMCR Register is cleared.
*/
#define SPMIE	7
/*
			       ********************************
******************************** Special Function IO Register ******************************
			       ********************************
*/
/*
** SFIOR – Special Function IO Register
*/
#define SFIOR	*(volatile U8 *const)0x50
/*
** When this bit is written to one, the pull-ups in the I/O ports are disabled even if the DDxn and PORTxn 
** Registers are configured to enable the pull-ups ({DDxn, PORTxn} = 0b01)
*/
#define PUD		2
/*
** PSR2: Prescaler Reset Timer/Counter2
** When this bit is written to one, the Timer/Counter2 prescaler will be reset. The bit will be cleared by hardware after the operation is 
** performed. Writing a zero to this bit will have no effect. This bit will always be read as zero if Timer/Counter2 is clocked by 
** the internal CPU clock. If this bit is written when Timer/Counter2 is operating in Asynchronous mode, the bit will remain one until 
** the prescaler has been reset.
*/
#define PSR2	1
/*
** ACME: Analog Comparator Multiplexer Enable
** When this bit is written logic one and the ADC is switched off (ADEN in ADCSRA is zero), the ADC multiplexer selects the negative input to 
** the Analog Comparator. When this bit is written logic zero, AIN1 is applied to the negative input of the Analog Comparator.
*/
#define ACME	3
/*
** ADTSn: ADC Auto Trigger Source [n = 2:0]
** If ADATE in ADCSRA is written to one, the value of these bits selects which source will trigger an ADC conversion.
** If ADATE is cleared, the ADTS2:0 settings will have no effect. A conversion will be triggered by the rising edge of the 
** selected Interrupt Flag. Note that switching from a trigger source that is cleared to a trigger source that is set, 
** will generate a positive edge on the trigger signal. If ADEN in ADCSRA is set, this will start a conversion. 
** Switching to Free Running mode (ADTS[2:0]=0) will not cause a trigger event, even if the ADC Interrupt Flag is set.
** ADC Auto Trigger Source Selections:
** ADTS2, ADTS1, ADTS0 = { 0 0 0: Free Running mode
						   0 0 1: Analog Comparator
						   0 1 0: External Interrupt Request 0
						   0 1 1: Timer/Counter0 Compare Match
						   1 0 0: Timer/Counter0 Overflow
						   1 0 1: Timer/Counter1 Compare Match B
						   1 1 0: Timer/Counter1 Overflow
						   1 1 1: Timer/Counter1 Capture Event }.
*/
#define ADTS2 	7
#define ADTS1	6
#define ADTS0	5
/*
			       ************************
******************************** 8-bit Timer/Counter0 ******************************
			       ************************
*/
/*
** TCCR0 – Timer/Counter Control Register.
** 
*/
#define TCCR0	*(volatile U8 *const)0x45
/*
** FOC0: Force Output Compare
** The FOC0 bit is only active when the WGM00 bit specifies a non-PWM mode. However, for ensuring
** compatibility with future devices, this bit must be set to zero when TCCR0 is written when operating in PWM mode.
** When writing a logical one to the FOC0 bit, an immediate Compare Match is forced on the waveform generation unit.
** The OC0 output is changed according to its COM21:0 bits setting. Note that the FOC0 bit is implemented as a strobe.
** Therefore it is the value present in the COM01:0 bits that determines the effect of the forced compare.
** A FOC0 strobe will not generate any interrupt, nor will it clear the timer in CTC mode using OCR0 as TOP. 
** The FOC0 bit is always read as zero.
*/
#define FOC0	7
/*
** WGM01(CTC0), WGM00(PWM0): Waveform Generation Mode.
** These bits control the counting sequence of the counter, the source for the maximum (TOP) counter value, 
** and what type of waveform generation to be used.
** Modes of operation supported by the Timer/Counter unit are: Normal mode, Clear Timer on Compare Match (CTC) mode, 
** and two types of Pulse Width Modulation (PWM) modes.
** Waveform Generation Mode Bit Description:
** WGM01(CTC0), WGM00(PWM0) = { 0 0: Normal mode, 			>>TOP= 0xFF, Update of OCR0= Immediate, TOV0 Flag Set= MAX,
**								0 1: PWM, Phase Correct, 	>>TOP= 0xFF, Update of OCR0= TOP, 		TOV0 Flag Set= BOTTOM,
**								1 0: CTC Mode,				>>TOP= OCR0, Update of OCR0= Immediate, TOV0 Flag Set= MAX,
**								1 1: Fast PWM 				>>TOP= 0xFF, Update of OCR0= BOTTOM, 	TOV0 Flag Set= MAX, }.
** >>Each one of these modes has special 4 modes by WGM00 & COM01 to control the Output Compare Pin (OC0) behavior.
*/
#define WGM00	6
#define WGM01	3
/*
** COM0n: Compare Match Output Mode [n = 1:0]
** These bits control the Output Compare Pin (OC0) behavior. If one or both of the COM01:0 bits are set,
** the OC0 output overrides the normal port functionality of the I/O pin it is connected to. However, note that the 
** Data Direction Register (DDR) bit corresponding to the OC0 pin must be set in order to enable the output driver.
** >>When OC0 is connected to the pin, the function of the COM01:0 bits depends on the WGM01:0 bit setting.
** Compare Output Mode, Non-PWM Mode ( Normal mode & CTC Mode ):
** COM01, COM00 = { 0 0: Normal port operation, OC0 disconnected.,
**				    0 1: Toggle OC0 on Compare Match,
**				    1 0: Clear OC0 on Compare Match,
**				    1 1: Set OC0 on Compare Match }.
** Compare Output Mode, Phase Correct PWM Mode:
** COM01, COM00 = { 0 0: Normal port operation, OC0 disconnected.,
**				    0 1: Reserved
**				    1 0: Clear OC0 on Compare Match when up-counting. Set OC0 on Compare Match when downcounting.
**				    1 1: Set OC0 on Compare Match when up-counting. Clear OC0 on Compare Match when downcounting. }.
** Compare Output Mode, Fast PWM Mode:
** COM01, COM00 = { 0 0: Normal port operation, OC0 disconnected.
**				    0 1: Reserved
**				    1 0: Clear OC0 on Compare Match, set OC0 at BOTTOM, (non-inverting mode)
**				    1 1: Set OC0 on Compare Match, clear OC0 at BOTTOM, (inverting mode) }.
*/
#define COM00	4
#define COM01	5
/*
** CS0n: Clock Select [n = 2:0]
** The three Clock Select bits select the clock source to be used by the Timer/Counter.
** Clock Select Bit Description:
** CS02, CS01, CS00 = { 0 0 0: No clock source (Timer/Counter stopped),
**						0 0 1: clk I/O /1 (No prescaling),
**						0 1 0: clk I/O /8 (From prescaler),
**						0 1 1: clk I/O /64 (From prescaler),
**						1 0 0: clkI/O/256 (From prescaler),
**						1 0 1: clk I/O /1024 (From prescaler),
**						1 1 0: External clock source on T0 pin. Clock on falling edge,
**						1 1 1: External clock source on T0 pin. Clock on falling edge. }.
*/
#define CS02	2
#define CS01	1
#define CS00	0
/*
** TCNT0 – Timer/Counter Register
** The Timer/Counter Register gives direct access, both for read and write operations, to the Timer/Counter unit 8-bit counter.
** Modifying the counter (TCNT0) while the counter is running, introduces a risk of missing a Compare Match between TCNT0 and the OCR0 Register.
** Writing to the TCNT0 Register blocks (removes) the Compare Match on the following timer clock.
*/
#define TCNT0	*(volatile U8 *const)0x44
/*
** OCR0 – Output Compare Register
** The Output Compare Register contains an 8-bit value that is continuously compared with the counter value (TCNT0).
** A match can be used to generate an Output Compare interrupt, or to generate a waveform output on the OC0 pin.
*/
#define OCR0	*(volatile U8 *const)0x43
/*
** TIMSK – Timer/Counter Interrupt Mask Register.
** 
*/
#define TIMSK	*(volatile U8 *const)0x59
/*
** OCIE0: Timer/CounterTimer/Counter0 Output Compare Match Interrupt Enable.
** When the OCIE0 bit is written to one and the I-bit in the Status Register is set (one), the Timer/Counter0 Compare Match interrupt is enabled.
** The corresponding interrupt is executed if a Compare Match in Timer/Counter0 occurs
** (i.e., when the OCF0 bit is set in the Timer/Counter Interrupt Flag Register – TIFR).
*/
#define OCIE0	1
/*
** TOIE0: Timer/CounterTimer/Counter0 Overflow Interrupt Enable.
** When the TOIE0 bit is written to one and the I-bit in the Status Register is set (one), the Timer/Counter0 Overflow interrupt is enabled.
** The corresponding interrupt is executed if an overflow in Timer/Counter0 occurs 
** (i.e., when the TOV0 bit is set in the Timer/Counter Interrupt Flag Register – TIFR).
*/
#define TOIE0	0
/*
** TIFR – Timer/Counter Interrupt Flag Register
*/
#define TIFR	*(volatile U8 *const)0x58
/*
** OCF0: Output Compare Flag 0.
** The OCF0 bit is set (one) when a Compare Match occurs between the Timer/Counter0 and the data in OCR0 – Output Compare Register0. 
** OCF0 is cleared by hardware when executing the corresponding interrupt Handling Vector. Alternatively, 
** OCF0 is cleared by writing a logic one to the flag. When the I-bit in SREG, OCIE0 (Timer/Counter0 Compare Match Interrupt Enable),
** and OCF0 are set (one), the Timer/Counter0 Compare Match Interrupt is executed.
*/
#define OCF0	1
/*
** TOV0: Timer/Counter0 Overflow Flag.
** The TOV0 bit is set (one) when an overflow occurs in Timer/Counter0. TOV0 is cleared by hardware when executing the 
** corresponding interrupt Handling Vector. Alternatively, TOV0 is cleared by writing a logic one to the flag. When the SREG I-bit, 
** TOIE0 (Timer/Counter0 Overflow Interrupt Enable), and TOV0 are set (one), the Timer/Counter0 Overflow interrupt is executed. 
** In PWM mode, this bit is set when Timer/Counter0 changes counting direction at 0x00.
*/
#define TOV0	0
/*
			       **************************
******************************** 16-bit Timer/Counter1  ******************************
			       **************************

