keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
** TCCR1A – Timer/Counter1 Control Register A
*/
#define TCCR1A	*(volatile U8 *const)0x4F
/*
** COM1An: Compare Output Mode for Channel A [n = 1:0].
*/
#define COM1A1	0
#define COM1A0	1
/*
** COM1Bn: Compare Output Mode for Channel B [n = 1:0].
** The COM1A1:0 and COM1B1:0 control the Output Compare pins (OC1A and OC1B respectively) behavior.
** If one or both of the COM1A1:0 bits are written to one, the OC1A output overrides the normal port functionality of 
** the I/O pin it is connected to. If one or both of the COM1B1:0 bit are written to one, the OC1B output overrides the 
** normal port functionality of the I/O pin it is connected to. . However, note that the Data Direction Register (DDR) bit corresponding to
** the OC1A or OC1B pin must be set in order to enable the output driver. When the OC1A or OC1B is connected to the pin, the function of the
** COM1n1:0 bits is dependent of the WGM13:0 bits setting. The table below shows the COM1n1:0 bit functionality when the WGM13:0 bits are
** set to a Normal or a CTC mode (non-PWM).
** Compare Output Mode, non-PWM:
** COM1A1/COM1B1, COM1A0/COM1B0 = { 0 0: Normal port operation, OC1A/OC1B disconnected,
**									0 1: Toggle OC1A/OC1B on Compare Match,
**									1 0: Clear OC1A/OC1B on Compare Match (Set output to low level),
**									1 1: Set OC1A/OC1B on Compare Match (Set output to high level).  }
** Compare Output Mode, Phase Correct and Phase and Frequency Correct PWM:
** COM1A1/COM1B1, COM1A0/COM1B0 = { 0 0: Normal port operation, OC1A/OC1B disconnected,
**									0 1: WGM13:0 = 9 or 14: Toggle OC1A on Compare Match, OC1B disconnected (normal port operation). 
**										 For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected,
**									1 0: Clear OC1A/OC1B on Compare Match when up-counting. Set OC1A/OC1B on Compare Match when down-counting,
**									1 1: Set OC1A/OC1B on Compare Match when up-counting. Clear OC1A/OC1B on Compare Match when down-counting. }
** Compare Output Mode, Fast PWM:
** COM1A1/COM1B1, COM1A0/COM1B0 = { 0 0: Normal port operation, OC1A/OC1B disconnected,
**									0 1: WGM13:0 = 15: Toggle OC1A on Compare Match, OC1B disconnected (normal port operation). 
**										 For all other WGM1 settings, normal port operation, OC1A/OC1B disconnected,
**									1 0: Clear OC1A/OC1B on Compare Match, set OC1A/OC1B at BOTTOM (non-inverting mode),
**									1 1: Set OC1A/OC1B on Compare Match, clear OC1A/OC1B at BOTTOM (inverting mode). }
*/
#define COM1B1	2
#define COM1B0	3
/*
** FOC1A: Force Output Compare for channel A.
*/
#define FOC1A	4
/*
** FOC1B: Force Output Compare for channel B.
** The FOC1A/FOC1B bits are only active when the WGM13:0 bits specifies a non-PWM mode. However, for ensuring compatibility with 
** future devices, these bits must be set to zero when TCCR1A is written when operating in a PWM mode.
** When writing a logical one to the FOC1A/FOC1B bit, an immediate Compare Match is forced on the waveform generation unit.
** The OC1A/OC1B output is changed according to its COM1x1:0 bits setting. Note that the FOC1A/FOC1B bits are implemented as strobes. 
** Therefore it is the value present in the COM1x1:0 bits that determine the effect of the forced compare.
** A FOC1A/FOC1B strobe will not generate any interrupt nor will it clear the timer in Clear Timer on Compare Match (CTC) mode using OCR1A as TOP.
** The FOC1A/FOC1B bits are always read as zero.
*/
#define FOC1B	5
/*
** WGM1n: Waveform Generation Mode [n = 1:0].
** Combined with the WGM13:2 bits found in the TCCR1B Register, these bits control the counting sequence of the counter, 
** the source for maximum (TOP) counter value, and what type of waveform generation to be used, refer to the table below. 
** Modes of operation supported by the Timer/Counter unit are: Normal mode (counter), Clear Timer on Compare match (CTC) mode, 
** and three types of Pulse Width Modulation (PWM) modes.
** Waveform Generation Mode Bit Description:
** WGM13, WGM12, WGM11, WGM10 = { 0 0 0 0: Normal,							>>TOP= 0xFFFF, UpdateOf OCR1x at= Immediate,TOV1 FlagSetOn= MAX,
**								  0 0 0 1: PWM, Phase Correct, 8-bit,		>>TOP= 0x00FF, UpdateOf OCR1x at= TOP,		TOV1 FlagSetOn= BOTTOM,
**								  0 0 1 0: PWM, Phase Correct, 9-bit,		>>TOP= 0x01FF, UpdateOf OCR1x at= TOP,		TOV1 FlagSetOn= BOTTOM,
**								  0 0 1 1: PWM, Phase Correct, 10-bit,		>>TOP= 0x03FF, UpdateOf OCR1x at= TOP,		TOV1 FlagSetOn= BOTTOM,
**								  0 1 0 0: CTC "Clear on compare match",	>>TOP= OCR1A,  UpdateOf OCR1x at= Immediate,TOV1 FlagSetOn= MAX,
**								  0 1 0 1: Fast PWM, 8-bit,					>>TOP= 0x00FF, UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= TOP,
**								  0 1 1 0: Fast PWM, 9-bit,					>>TOP= 0x01FF, UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= TOP,
**								  0 1 1 1: Fast PWM, 10-bit,				>>TOP= 0x03FF, UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= TOP,
**								  1 0 0 0: PWM, Phase and Frequency Correct,>>TOP= ICR1,   UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= BOTTOM,
**								  1 0 0 1: PWM, Phase and Frequency Correct,>>TOP= OCR1A,  UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn=	BOTTOM,
**								  1 0 1 0: PWM, Phase Correct,				>>TOP= ICR1,   UpdateOf OCR1x at= TOP,		TOV1 FlagSetOn= BOTTOM,
**								  1 0 1 1: PWM, Phase Correct,				>>TOP= OCR1A,  UpdateOf OCR1x at= TOP,		TOV1 FlagSetOn= BOTTOM,
**								  1 1 0 0: CTC,	"Clear on compare match"	>>TOP= CR1,	   UpdateOf OCR1x at= Immediate,TOV1 FlagSetOn= MAX,
**								  1 1 0 1: Reserved,						>>- - - - - - - - - - - - -  - - - - - - - - - - - - - - - - - - - -
**								  1 1 1 0: Fast PWM,						>>TOP= ICR1,   UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= TOP,
**								  1 1 1 1: Fast PWM,						>>TOP= OCR1A,  UpdateOf OCR1x at= BOTTOM,	TOV1 FlagSetOn= TOP, }
*/
#define WGM10	7
#define WGM11	6

/*
** TCCR1B – Timer/Counter1 Control Register B
*/
#define TCCR1B	*(volatile U8 *const)0x4E
/*
** ICNC1: Input Capture Noise Canceler.
** Setting this bit (to one) activates the Input Capture Noise Canceler. When the noise canceler is activated, 
** the input from the Input Capture pin (ICP1) is filtered. The filter function requires four successive equal valued samples of the 
** ICP1 pin for changing its output. The Input Capture is therefore delayed by four Oscillator cycles when the noise canceler is enabled.
*/
#define ICNC1 	7
/*
** ICES1: Input Capture Edge Select.
** This bit selects which edge on the Input Capture pin (ICP1) that is used to trigger a capture event. When the ICES1 bit is written to zero, 
** a falling (negative) edge is used as trigger, and when the ICES1 bit is written to one, a rising (positive) edge will trigger the capture.
** When a capture is triggered according to the ICES1 setting, the counter value is copied into the Input Capture Register (ICR1). 
** The event will also set the Input Capture Flag (ICF1), and this can be used to cause an Input Capture Interrupt, if this interrupt is enabled.
** When the ICR1 is used as TOP value (see description of the WGM13:0 bits located in the TCCR1A and the TCCR1B Register), 
** the ICP1 is disconnected and consequently the Input Capture function is disabled.
*/
#define ICES1	6
/*
** with FOC1A.
*/
#define WGM13	4
#define WGM12	3
/*
** CS1n: Clock Select [n = 0:2].
** The three Clock Select bits select the clock source to be used by the Timer/Counter. Refer to figures Timer/Counter Timing Diagram, 
** Setting of OCF1x, no Prescaling and Timer/Counter Timing Diagram, Setting of OCF1x, with Prescaler (f clk_I/O /8).
** Clock Select Bit Description:
** CS12, CS11, CS10 = { 0 0 0: No clock source (Timer/Counter stopped),
**						0 0 1: clk I/O /1 (No prescaling),
**						0 1 0: clk I/O /8 (From prescaler),
**						1 0 0: clk I/O /64 (From prescaler),
**						1 0 0: clkI/O/256 (From prescaler),
**						1 0 1: clk I/O /1024 (From prescaler),
**						1 1 0: External clock source on T1 pin. Clock on falling edge,
**						1 1 1: External clock source on T1 pin. Clock on rising edge. }.
** If external pin modes are used for the Timer/Counter1, transitions on the T1 pin will clock the counter even if the 
** pin is configured as an output. This feature allows software control of the counting.
*/
#define CS12	2
#define CS11	1
#define	CS10	0


