keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
/*
** TCNT1L – Timer/Counter1 Low byte.
** The two Timer/Counter I/O locations (TCNT1H and TCNT1L, combined TCNT1) give direct access, both for read and for write operations, 
** to the Timer/Counter unit 16-bit counter. To ensure that both the high and low bytes are read and written simultaneously when 
** the CPU accesses these registers, the access is performed using an 8-bit temporary High Byte Register (TEMP). 
** This temporary register is shared by all the other 16-bit registers.
** Modifying the counter (TCNT1) while the counter is running introduces a risk of missing a compare match between 
** TCNT1 and one of the OCR1x Registers. 
** Writing to the TCNT1 Register blocks (removes) the compare match on the following timer clock for all compare units.
*/
#define TCNT1L	*(volatile U8 *const)0x4C
/*
** TCNT1H – Timer/Counter1 High byte.
*/
#define TCNT1H	*(volatile U8 *const)0x4D
/*
** Assuming the CPU is little endian memory storing, TCNT1 can be written as:
*/
#define TCNT1	*(volatile U16 *const)0x4C

/*
** OCR1AL – Output Compare Register 1 A Low byte
** The Output Compare Registers contain a 16-bit value that is continuously compared with the counter value (TCNT1). 
** A match can be used to generate an Output Compare interrupt, or to generate a waveform output on the OC1x pin.
** The Output Compare Registers are 16-bit in size. To ensure that both the high and low bytes are written simultaneously when 
** the CPU writes to these registers, the access is performed using an 8-bit temporary High Byte Register (TEMP). 
** This temporary register is shared by all the other 16-bit registers.
*/
#define OCR1AL	*(volatile U8 *const)0x4A
/*
** OCR1AH – Output Compare Register 1 A High byte
*/
#define OCR1AH	*(volatile U8 *const)0x4B
/*
** Assuming the CPU is little endian memory storing, OCR1A can be written as:
*/
#define OCR1A	*(volatile U16 *const)0x4A
/*
** OCR1BL – Output Compare Register 1 B Low byte
*/
#define OCR1BL	*(volatile U8 *const)0x48
/*
** OCR1BH – Output Compare Register 1 B High byte
*/
#define OCR1BH	*(volatile U8 *const)0x49
/*
** Assuming the CPU is little endian memory storing, OCR1B can be written as:
*/
#define OCR1B	*(volatile U16 *const)0x48
/*
** ICR1L – Input Capture Register 1 Low byte
** The Input Capture is updated with the counter (TCNT1) value each time an event occurs on the ICP1 pin 
** (or optionally on the Analog Comparator output for Timer/Counter1). The Input Capture can be used for defining the counter TOP value.
** The Input Capture Register is 16-bit in size. To ensure that both the high and low bytes are read simultaneously when the CPU accesses 
** these registers, the access is performed using an 8-bit temporary High Byte Register (TEMP). 
** This temporary register is shared by all the other 16-bit registers.
*/
#define ICR1L	*(volatile U8 *const)0x46
/*
** ICR1H – Input Capture Register 1 High byte.
*/
#define ICR1H	*(volatile U8 *const)0x47
/*
** Assuming the CPU is little endian memory storing, ICR1 can be written as:
*/
#define ICR1	*(volatile U16 *const)0x46
/*
** TIMSK – Timer/Counter Interrupt Mask Register
** common for 3 timers, can't be defined because it defined in Timer0 before.
** This register contains interrupt control bits for several Timer/Counters, but only Timer1 bits are described in this section. 
** The remaining bits are described in their respective timer sections.
*/

/*
** TICIE1: Timer/Counter1, Input Capture Interrupt Enable.
** When this bit is written to one, and the I-flag in the Status Register is set (interrupts globally enabled), 
** the Timer/Counter1 Input Capture interrupt is enabled. The corresponding Interrupt Vector (see Interrupts on page 63) is executed when 
** the ICF1 Flag, located in TIFR, is set.
*/
#define TICIE1	5
/*
** OCIE1A: Timer/Counter1, Output Compare A Match Interrupt Enable.
** When this bit is written to one, and the I-flag in the Status Register is set (interrupts globally enabled), 
** the Timer/Counter1 Output Compare A match interrupt is enabled. The corresponding Interrupt Vector (see Interrupts on page 63) 
** is executed when the OCF1A Flag, located in TIFR, is set.
*/
#define OCIE1A	4
/*
** OCIE1B: Timer/Counter1, Output Compare B Match Interrupt Enable.
** When this bit is written to one, and the I-flag in the Status Register is set (interrupts globally enabled), 
** the Timer/Counter1 Output Compare B match interrupt is enabled. The corresponding Interrupt Vector (see Interrupts on page 63) is 
** executed when the OCF1B Flag, located in TIFR, is set.
*/
#define OCIE1B	3
/*
** TOIE1: Timer/Counter1, Overflow Interrupt Enable.
** When this bit is written to one, and the I-flag in the Status Register is set (interrupts globally enabled), 
** the Timer/Counter1 Overflow Interrupt is enabled. The corresponding Interrupt Vector (see Interrupts on page 63) is 
** executed when the TOV1 Flag, located in TIFR, is set.
*/
#define TOIE1	2

/*
** TIFR – Timer/Counter Interrupt Flag Register
** common for 3 timers, can't be defined because it defined in Timer0 before.
*/

/*
** ICF1: Timer/Counter1, Input Capture Flag
** This flag is set when a capture event occurs on the ICP1 pin. When the Input Capture Register (ICR1) is
** set by the WGM13:0 to be used as the TOP value, the ICF1 Flag is set when the counter reaches the TOP value.
** ICF1 is automatically cleared when the Input Capture Interrupt Vector is executed. Alternatively, ICF1 can be cleared by 
** writing a logic one to its bit location.
*/
#define ICF1	5
/*
** OCF1A: Timer/Counter1, Output Compare A Match Flag
** This flag is set in the timer clock cycle after the counter (TCNT1) value matches the Output Compare Register A (OCR1A).
** Note that a Forced Output Compare (FOC1A) strobe will not set the OCF1A Flag.
** OCF1A is automatically cleared when the Output Compare Match A Interrupt Vector is executed. Alternatively, OCF1A can be 
** cleared by writing a logic one to its bit location.
*/
#define OCF1A	4
/*
** OCF1B: Timer/Counter1, Output Compare B Match Flag
** This flag is set in the timer clock cycle after the counter (TCNT1) value matches the Output Compare Register B (OCR1B).
** Note that a Forced Output Compare (FOC1B) strobe will not set the OCF1B Flag.
** OCF1B is automatically cleared when the Output Compare Match B Interrupt Vector is executed. Alternatively, OCF1B can be 
** cleared by writing a logic one to its bit location.
*/
#define OCF1B	3
/*
** TOV1: Timer/Counter1, Overflow Flag.
** The setting of this flag is dependent of the WGM13:0 bits setting. In Normal and CTC modes, the TOV1 Flag is set when the timer overflows.
** TOV1 is automatically cleared when the Timer/Counter1 Overflow Interrupt Vector is executed. Alternatively, TOV1 can be 
** cleared by writing a logic one to its bit location.
*/
#define TOV1	2
/*
			       ********************************************
******************************** 8-bit Timer/Counter2, Asynchronous mode  ******************************
			       ********************************************
*/
/*
** TCCR2 – Timer/Counter Control Register
*/
#define TCCR2	*(volatile U8 *const)0x45
/*
** FOC2: Force Output Compare
** The FOC2 bit is only active when the WGM bits specify a non-PWM mode. However, for ensuring compatibility with future devices, 
** this bit must be set to zero when TCCR2 is written when operating in PWM mode. When writing a logical one to the FOC2 bit, 
** an immediate Compare Match is forced on the waveform generation unit. The OC2 output is changed according to its COM21:0 bits setting. 
** Note that the FOC2 bit is implemented as a strobe. Therefore it is the value present in the COM21:0 bits that
** determines the effect of the forced compare.
** A FOC2 strobe will not generate any interrupt, nor will it clear the timer in CTC mode using OCR2 as TOP.
** The FOC2 bit is always read as zero.
*/
#define FOC2 	7
/*
** WGM20: Waveform Generation Mode [n=0:1]
** These bits control the counting sequence of the counter, the source for the maximum (TOP) counter value, 
** and what type of waveform generation to be used. Modes of operation supported by the Timer/Counter unit are: Normal mode, 
** Clear Timer on Compare Match (CTC) mode, and two types of Pulse Width Modulation (PWM) modes.
** Waveform Generation Mode Bit Description:
** WGM21(CTC2), WGM20(PWM2) = { 0 0: Normal,			>> TOP= 0xFF, Update of OCR2= Immediate, TOV2 Flag Set= MAX,
**								0 1: PWM, Phase Correct,>> TOP= 0xFF, Update of OCR2= TOP,		 TOV2 Flag Set= BOTTOM,
**								1 0: CTC,				>> TOP= OCR2, Update of OCR2= Immediate, TOV2 Flag Set= MAX,
**								1 1: Fast PWM.			>> TOP=	0xFF, Update of OCR2= BOTTOM,	 TOV2 Flag Set= MAX. }.
** Note:  1. The CTC2 and PWM2 bit definition names are now obsolete. Use the WGM21:0 definitions.
** However, the functionality and location of these bits are compatible with previous versions of the timer.
*/
#define WGM20	6
#define WGM21	3
/*
** COM2n: Compare Match Output Mode [n = 1:0]
** These bits control the Output Compare Pin (OC2) behavior. If one or both of the COM21:0 bits are set,
** the OC2 output overrides the normal port functionality of the I/O pin it is connected to. However, 
** note that the Data Direction Register (DDR) bit corresponding to OC2 pin must be set in order to enable the output driver.
** When OC2 is connected to the pin, the function of the COM21:0 bits depends on the WGM21:0 bit setting. 
** The following table shows the COM21:0 bit functionality when the WGM21:0 bits are set to a normal or CTC mode (non-PWM).
** Compare Output Mode, Non-PWM Mode:
** COM21, COM20 = { 0 0: Normal port operation, OC2 disconnected.,
**					0 1: Toggle OC2 on Compare Match,
**					1 0: Clear OC2 on Compare Match,
**					1 1: Set OC2 on Compare Match.  }
** Compare Output Mode, Phase Correct PWM Mode:
** COM21, COM20 = { 0 0: Normal port operation, OC2 disconnected,
**					0 1: Reserved,
**					1 0: Clear OC2 on Compare Match when up-counting. Set OC2 on Compare Match when downcounting,
**					1 1: Set OC2 on Compare Match when up-counting. Clear OC2 on Compare Match when downcounting.  }
** A special case occurs when OCR2 equals TOP and COM21 is set. In this case, the Compare Match is ignored, but the set or clear is done at TOP.
** Compare Output Mode, Fast PWM Mode:
** COM21, COM20 = { 0 0: Normal port operation, OC2 disconnected,
**					0 1: Reserved,
**					1 0: Clear OC2 on Compare Match, set OC2 at BOTTOM, (non-inverting mode),
**					1 1: Set OC2 on Compare Match, clear OC2 at BOTTOM, (inverting mode).  }
** A special case occurs when OCR2 equals TOP and COM21 is set. In this case, the Compare Match is ignored, but the set or 
** clear is done at BOTTOM.
*/
#define COM21	5
#define COM20	4
/*
** CS2n: Clock Select [n = 2:0].
** The three Clock Select bits select the clock source to be used by the Timer/Counter.
** Clock Select Bit Description:
** CS12, CS11, CS10 = { 0 0 0: No clock source (Timer/Counter stopped),
**						0 0 1: clk I/O /1 (No prescaling),
**						0 1 0: clk I/O /8 (From prescaler),
**						1 0 0: clk I/O /64 (From prescaler),
**						1 0 0: clkI/O/256 (From prescaler),
**						1 0 1: clk I/O /1024 (From prescaler),
**						1 1 0: External clock source on T1 pin. Clock on falling edge,
**						1 1 1: External clock source on T1 pin. Clock on rising edge. }.
*/
#define CS22	2
#define CS21	1
#define CS20	0

