keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
/*
** TCNT0 – Timer/Counter Register
** The Timer/Counter Register gives direct access, both for read and write operations, to the Timer/Counter unit 8-bit counter. 
** Writing to the TCNT0 Register blocks (removes) the Compare Match on the following timer clock. 
** Modifying the counter (TCNT0) while the counter is running, introduces a risk of missing a Compare Match between TCNT0 and the OCR0 Register.
*/
#define TCNT0	*(volatile U8 *const)0x44
/*
** OCR0 – Output Compare Register
** The Output Compare Register contains an 8-bit value that is continuously compared with the counter value (TCNT0). 
** A match can be used to generate an Output Compare interrupt, or to generate a waveform output on the OC0 pin.
*/ 
#define OCR0	*(volatile U8 *const)0x43

/*
** ASSR – Asynchronous Status Register 
*/
#define ASSR	*(volatile U8 *const)0x42
/*
** AS2: Asynchronous Timer/Counter2
** When AS2 is written to zero, Timer/Counter 2 is clocked from the I/O clock, clk I/O . When AS2 is written to one, Timer/Counter 2 is 
** clocked from a crystal Oscillator connected to the Timer Oscillator 1 (TOSC1) pin.
** When the value of AS2 is changed, the contents of TCNT2, OCR2, and TCCR2 might be corrupted.
*/
#define AS2		3
/*
** TCN2UB: Timer/Counter2 Update Busy
** When Timer/Counter2 operates asynchronously and TCNT2 is written, this bit becomes set. When TCNT2 has been updated from 
** the temporary storage register, this bit is cleared by hardware. A logical zero in this bit indicates that TCNT2 is ready to be 
** updated with a new value.
*/
#define TCN2UB	2
/*
** OCR2UB: Output Compare Register2 Update Busy
** When Timer/Counter2 operates asynchronously and OCR2 is written, this bit becomes set. When OCR2 has been updated from the 
** temporary storage register, this bit is cleared by hardware. A logical zero in this bit indicates that OCR2 is ready to be 
** updated with a new value.
*/
#define OCR2UB	1
/*
** TCR2UB: Timer/Counter Control Register2 Update Busy
** When Timer/Counter2 operates asynchronously and TCCR2 is written, this bit becomes set. When TCCR2 has been updated from 
** the temporary storage register, this bit is cleared by hardware. A logical zero in this bit indicates that TCCR2 is ready to be 
** updated with a new value. If a write is performed to any of the three Timer/Counter2 Registers while its update busy flag is set, 
** the updated value might get corrupted and cause an unintentional interrupt to occur. The mechanisms for reading TCNT2, OCR2, 
** and TCCR2 are different. When reading TCNT2, the actual timer value is read. When reading OCR2 or TCCR2, 
** the value in the temporary storage register is read.
*/
#define TCR2UB	0
/*
** TIMSK – Timer/Counter Interrupt Mask Register
** common for 3 timers, can't be defined because it defined in Timer0 before.
*/
/*
** OCIE2: Timer/Counter2 Output Compare Match Interrupt Enable
** When the OCIE2 bit is written to one and the I-bit in the Status Register is set (one), the Timer/Counter2 Compare Match interrupt is enabled. ** The corresponding interrupt is executed if a Compare Match in Timer/Counter2 occurs 
** (i.e., when the OCF2 bit is set in the Timer/Counter Interrupt Flag Register – TIFR).
*/
#define OCIE2	7
/*
** TOIE2: Timer/Counter2 Overflow Interrupt Enable
** When the TOIE2 bit is written to one and the I-bit in the Status Register is set (one), the Timer/Counter2 Overflow interrupt is enabled. 
** The corresponding interrupt is executed if an overflow in Timer/Counter2 occurs 
** (i.e., when the TOV2 bit is set in the Timer/Counter Interrupt Flag Register – TIFR).
*/
#define TOIE2	6
/*
** TIFR – Timer/Counter Interrupt Flag Register.
** common for 3 timers, can't be defined because it defined in Timer0 before.
*/
/*
** OCF2: Output Compare Flag 2
** The OCF2 bit is set (one) when a Compare Match occurs between the Timer/Counter2 and the data in OCR2 – Output Compare Register2. 
** OCF2 is cleared by hardware when executing the corresponding interrupt Handling Vector. Alternatively, OCF2 is cleared by writing a 
** logic one to the flag. When the I-bit in SREG, OCIE2 (Timer/Counter2 Compare Match Interrupt Enable), and OCF2 are set (one), 
** the Timer/ Counter2 Compare Match Interrupt is executed.
*/
#define OCF2	7
/*
** TOV2: Timer/Counter2 Overflow Flag
** The TOV2 bit is set (one) when an overflow occurs in Timer/Counter2. TOV2 is cleared by hardware when executing the corresponding 
** interrupt Handling Vector. Alternatively, TOV2 is cleared by writing a logic one to the flag. When the SREG I-bit, 
** TOIE2 (Timer/Counter2 Overflow Interrupt Enable), and TOV2 are set (one), the Timer/Counter2 Overflow interrupt is executed. 
** In PWM mode, this bit is set when Timer/Counter2 changes counting direction at 0x00.
*/
#define TOV2	6
/*
			       **********************
******************************** Analog Comparator  ******************************
			       **********************
*/

/*
** ACSR – Analog Comparator Control and Status Register 
*/
#define ACSR	*(volatile U8 *const)0x28
/*
** ACD: Analog Comparator Disable
** When this bit is written logic one, the power to the Analog Comparator is switched off. This bit can be set at any time to turn off 
** the Analog Comparator. This will reduce power consumption in Active and Idle mode. When changing the ACD bit, the Analog Comparator 
** Interrupt must be disabled by clearing the ACIE bit in ACSR. Otherwise an interrupt can occur when the bit is changed.
*/
#define ACD 	7
/*
** ACBG: Analog Comparator Bandgap Select
** When this bit is set, a fixed bandgap reference voltage replaces the positive input to the Analog Comparator. When this bit is cleared, 
** AIN0 is applied to the positive input of the Analog Comparator.
*/
#define ACBG 	6
/*
** ACO: Analog Comparator Output
** The output of the Analog Comparator is synchronized and then directly connected to ACO. 
** The synchronization introduces a delay of 1 - 2 clock cycles.
*/
#define ACO 	5
/*
** ACI: Analog Comparator Interrupt Flag
** This bit is set by hardware when a comparator output event triggers the interrupt mode defined by ACIS1 and ACIS0. 
** The Analog Comparator interrupt routine is executed if the ACIE bit is set and the I-bit in SREG is set. 
** ACI is cleared by hardware when executing the corresponding interrupt handling vector. Alternatively, ACI is cleared by writing a 
** logic one to the flag.
*/
#define ACI 	4
/*
** ACIE: Analog Comparator Interrupt Enable
** When the ACIE bit is written logic one and the I-bit in the Status Register is set, 
** the Analog Comparator interrupt is activated. When written logic zero, the interrupt is disabled.
*/
#define ACIE 	3
/*
** ACIC: Analog Comparator Input Capture Enable
** When written logic one, this bit enables the input capture function in Timer/Counter1 to be triggered by the Analog Comparator. 
** The comparator output is in this case directly connected to the input capture front-end logic, making the comparator utilize the noise 
** canceler and edge select features of the Timer/ Counter1 Input Capture interrupt. 
** When written logic zero, no connection between the Analog Comparator and the input capture function exists. 
** To make the comparator trigger the Timer/Counter1 Input Capture interrupt, the ICIE1 bit in the Timer Interrupt 
** Mask Register (TIMSK1) must be set.
*/
#define ACIC 	2
/*
** ACISn: Analog Comparator Interrupt Mode Select [n = 1:0]
** These bits determine which comparator events that trigger the Analog Comparator interrupt.
** ACIS1, ACIS0 = { 0 0: Comparator Interrupt on Output Toggle,
					0 1: Reserved,
					1 0: Comparator Interrupt on Falling Output Edge,
					1 1: Comparator Interrupt on Rising Output Edge. }.
** When changing the ACIS1/ACIS0 bits, the Analog Comparator Interrupt must be disabled by clearing its Interrupt Enable bit in the 
** ACSR Register. Otherwise an interrupt can occur when the bits are changed.
*/
#define ACIS1 	1
#define ACIS0	0
/*
			       **************************************
******************************** ADC - Analog to Digital Converter  ******************************
			       **************************************
*/
/*
** ADMUX – ADC Multiplexer Selection Register
*/
#define ADMUX	*(volatile U8 *const)0x27
/*
** REFSn: Reference Selection [n = 1:0]
** These bits select the voltage reference for the ADC. If these bits are changed during a conversion, the change will not go in 
** effect until this conversion is complete (ADIF in ADCSRA is set). The internal voltage reference options may not be used if an external 
** reference voltage is being applied to the AREF pin. ADC Voltage Reference Selection:
** REFS1, REFS0 = { 0 0: AREF, Internal V ref turned off
					0 1: AV CC with external capacitor at AREF pin
					1 0: Reserved
					1 1: Internal 2.56V Voltage Reference with external capacitor at AREF pin }.
*/
#define REFS1	7
#define REFS0	6
/*
** ADLAR: ADC Left Adjust Result
** The ADLAR bit affects the presentation of the ADC conversion result in the ADC Data Register. Write one to ADLAR to left adjust the result. 
** Otherwise, the result is right adjusted. Changing the ADLAR bit will affect the ADC Data Register immediately, 
** regardless of any ongoing conversions.
*/
#define ADLAR	5
/*
** MUXn: Analog Channel Selection [n = 4:0]
** The value of these bits selects which combination of analog inputs are connected to the ADC. 
** These bits also select the gain for the differential channels. Refer to table below for details. If these bits are changed during a 
** conversion, the change will not go in effect until this conversion is complete (ADIF in ADCSRA on page 278 is set).
** Input Channel and Gain Selections: Read page 276.
*/
#define MUX4	4
#define MUX3	3
#define MUX2	2
#define MUX1	1
#define MUX0	0
/*
** ADCSRA – ADC Control and Status Register A
*/
#define ADCSRA	*(volatile U8 *const)0x26
/*
** ADEN: ADC Enable
** Writing this bit to one enables the ADC. By writing it to zero, the ADC is turned off. Turning the ADC off while a conversion is 
** in progress, will terminate this conversion.
*/
#define ADEN 	7
/*
** ADSC: ADC Start Conversion
** In Single Conversion mode, write this bit to one to start each conversion. In Free Running mode, write this bit to one to start the 
** first conversion. The first conversion after ADSC has been written after the ADC has been enabled, or if ADSC is written at 
** the same time as the ADC is enabled, will take 25 ADC clock cycles instead of the normal 13. This first conversion performs initialization of ** the ADC.  ADSC will read as one as long as a conversion is in progress. When the conversion is complete, it returns to zero. 
** Writing zero to this bit has no effect.
*/
#define ADSC 	6
/*
** ADATE: ADC Auto Trigger Enable
** When this bit is written to one, Auto Triggering of the ADC is enabled. The ADC will start a conversion on a positive edge of the 
** selected trigger signal. The trigger source is selected by setting the ADC Trigger Select bits, ADTS in SFIOR.
*/
#define ADATE 	5
/*
** ADC Interrupt Flag
** This bit is set when an ADC conversion completes and the Data Registers are updated. The ADC Conversion Complete Interrupt is executed if 
** the ADIE bit and the I-bit in SREG are set. ADIF is cleared by hardware when executing the corresponding interrupt Handling Vector. 
** Alternatively, ADIF is cleared by writing a logical one to the flag. Beware that if doing a Read-Modify-Write on ADCSRA, 
** a pending interrupt can be disabled. This also applies if the SBI and CBI instructions are used.
*/
#define ADIF 	4
/*
** ADIE: ADC Interrupt Enable
** When this bit is written to one and the I-bit in SREG is set, the ADC Conversion Complete Interrupt is activated.
*/
#define ADIE 	3
/*
** ADPSn: ADC Prescaler Select [n = 2:0]
** These bits determine the division factor between the XTAL frequency and the input clock to the ADC.
** ADC Prescaler Selections:
** ADPS2, ADPS1, ADPS0 = { 0 0 0: Division Factor= 2
						   0 0 1: Division Factor= 2
						   0 1 0: Division Factor= 4
						   0 1 1: Division Factor= 8
						   1 0 0: Division Factor= 16
						   1 0 1: Division Factor= 32
						   1 1 0: Division Factor= 64
						   1 1 1: Division Factor= 128 }.
*/
#define ADPS2 	2
#define ADPS1 	1
#define ADPS0	0
/*
** ADCL – ADC Data Register Low (ADLAR=0) 
** When an ADC conversion is complete, the result is found in these two registers. If differential channels are used, 
** the result is presented in two’s complement form. When ADCL is read, the ADC Data Register is not updated until ADCH is read. 
** Consequently, if the result is left adjusted and no more than 8-bit precision is required, it is sufficient to read ADCH. 
** Otherwise, ADCL must be read first, then ADCH. The ADLAR bit and the MUXn bits in ADMUX affect the way the result is read from the registers. ** If ADLAR is set, the result is left adjusted. If ADLAR is cleared (default), the result is right adjusted.
*/
#define ADCL	*(volatile const U8 *const)0x24
/*
** ADCn: ADC Conversion Result [n = 7:0]
** These bits represent the result from the conversion. Refer to ADC Conversion Result for details.
*/
#define ADC7 	7
#define ADC6 	6
#define ADC5 	5
#define ADC4 	4
#define ADC3 	3
#define ADC2 	2
#define ADC1 	1
#define ADC0	0
/*
** ADCH – ADC Data Register High (ADLAR=0).
*/
#define ADCH	*(volatile const U8 *const)0x25
#define ADC9 	1
#define ADC8	0
/*
** Assuming the CPU storing memory is little endian, ADC can used as:
*/
#define ADC	*(volatile const U16 *const)0x24
/*
			       **************************************
******************************** SPI – Serial Peripheral Interface  ******************************
			       **************************************
*/

