keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
/*
** SPCR – SPI Control Register
*/
#define SPCR	*(volatile U8 *const)0x2D
/*
** SPIE: SPI Interrupt Enable
** This bit causes the SPI interrupt to be executed if SPIF bit in the SPSR Register is set and if the Global Interrupt Enable bit in SREG is set.
*/
#define SPIE	7
/*
** SPE: SPI Enable
** When the SPE bit is written to one, the SPI is enabled. This bit must be set to enable any SPI operations.
*/
#define SPE		6
/*
** DORD: Data Order
** When the DORD bit is written to one, the LSB of the data word is transmitted first.
** When the DORD bit is written to zero, the MSB of the data word is transmitted first
*/
#define DORD	5
/*
** MSTR: Master/Slave Select
** This bit selects Master SPI mode when written to one, and Slave SPI mode when written logic zero. 
** If SS is configured as an input and is driven low while MSTR is set, MSTR will be cleared, and SPIF in SPSR
** will become set. The user will then have to set MSTR to re-enable SPI Master mode.
*/
#define MSTR	4
/*
** When this bit is written to one, SCK is high when idle. When CPOL is written to zero, SCK is low when idle. 
** The CPOL functionality is summarized below:
** CPOL= 0, Leading Edge= Rising, Trailing Edge= Falling.
** CPOL= 1, Leading Edge= Falling, Trailing Edge= Rising.
*/
#define CPOL	3
/*
** CPHA: Clock Phase
The settings of the Clock Phase bit (CPHA) determine if data is sampled on the leading (first) or trailing (last) edge of SCK. 
** The CPHA functionality is summarized below:
** CPHA= 0, Leading Edge= Sample, Trailing Edge= Setup.
** CPHA= 1, Leading Edge= Setup,  Trailing Edge= Sample.
*/
#define CPHA	2
/*
** SPRn: SPI Clock Rate Select [n = 1:0]
These two bits control the SCK rate of the device configured as a Master. SPR1 and SPR0 have no effect
on the Slave. The relationship between SCK and the Oscillator Clock frequency f osc is shown below. 
** Relationship between SCK and Oscillator Frequency:
** SPI2X, SPR1, SPR0 = { 0 0 0: f osc /4
				  		 0 0 1: f osc /16
				 		 0 1 0: f osc /64
				  		 0 1 1: f osc /128
				 		 1 0 0: f osc /2
				 		 1 0 1: f osc /8
				 		 1 1 0: f osc /32
				 		 1 1 1: f osc /64 }.
*/
#define SPR1	1
#define SPR0	0
/*
** SPSR – SPI Status Register
*/
#define SPSR	*(volatile U8 *const)0x2E
/*
** SPIF: SPI Interrupt Flag
** When a serial transfer is complete, the SPIF Flag is set. An interrupt is generated if SPIE in SPCR is set and global interrupts are enabled. ** If SS is an input and is driven low when the SPI is in Master mode, this will also set the SPIF Flag. SPIF is cleared by 
** hardware when executing the corresponding interrupt handling vector. Alternatively, the SPIF bit is cleared by first reading 
** the SPI Status Register with SPIF set, then accessing the SPI Data Register (SPDR).
*/
#define SPIF 	7
/*
** WCOL: Write Collision Flag
** The WCOL bit is set if the SPI Data Register (SPDR) is written during a data transfer. The WCOL bit (and the SPIF bit) are cleared by 
** first reading the SPI Status Register with WCOL set, and then accessing the SPI Data Register.
*/
#define WCOL	6
/*
** SPI2X: Double SPI Speed Bit
** When this bit is written logic one the SPI speed (SCK Frequency) will be doubled when the SPI is in Master mode.
** This means that the minimum SCK period will be two CPU clock periods. When the SPI is configured as Slave, the SPI is only 
** guaranteed to work at f osc /4 or lower.
** The SPI interface on the ATmega32A is also used for program memory and EEPROM downloading or uploading.
*/
#define SPI2X	0
/*
** SPDR – SPI Data Register is a read/write register
*/
#define SPDR	*(volatile U8 *const)0x2F
/*
** SPIDn: SPI Data
** The SPI Data Register is a read/write register used for data transfer between the Register File and the SPI Shift Register. 
** Writing to the register initiates data transmission. Reading the register causes the Shift Register Receive buffer to be read.
*/
#define SPID7 	7
#define SPID6 	6
#define SPID5 	5
#define SPID4 	4
#define SPID3 	3
#define SPID2 	2
#define SPID1 	1
#define SPID0	0

/*
			       ***********************************************************************************
******************************** USART - Universal Synchronous and Asynchronous serial Receiver and Transmitter  ******************************
			       ***********************************************************************************
*/
/*
** UDR – USART I/O Data Register
*/
#define UDR	  *(volatile U8 *const)0x2C
/*
** TXB/RXB[7:0]: USART Transmit / Receive Data Buffer.
** The USART Transmit Data Buffer Register and USART Receive Data Buffer Registers share the same I/O address referred to 
** as USART Data Register or UDR. The Transmit Data Buffer Register (TXB) will be the destination for data written to the UDR Register location. ** Reading the UDR Register location will return the contents of the Receive Data Buffer Register (RXB).
** For 5-, 6-, or 7-bit characters the upper unused bits will be ignored by the Transmitter and set to zero by the Receiver.
** The transmit buffer can only be written when the UDRE Flag in the UCSRA Register is set. Data written to UDR when the UDRE Flag is not set, 
** will be ignored by the USART Transmitter. When data is written to the transmit buffer, and the Transmitter is enabled, the Transmitter will 
** load the data into the Transmit Shift Register when the Shift Register is empty. Then the data will be serially transmitted on the TxD pin.
** The receive buffer consists of a two level FIFO. The FIFO will change its state whenever the receive buffer is accessed. 
** Due to this behavior of the receive buffer, do not use Read-Modify-Write instructions (SBI and CBI) on this location. 
** Be careful when using bit test instructions (SBIC and SBIS), since these also will change the state of the FIFO.
*/
/*
** UCSRA – USART Control and Status Register A
*/
#define UCSRA	*(volatile U8 *const)0x2B
/*
** RXC: USART Receive Complete
** This flag bit is set when there are unread data in the receive buffer and cleared when the receive buffer is empty 
** (i.e. does not contain any unread data). If the Receiver is disabled, the receive buffer will be flushed and consequently 
** the RXC bit will become zero. The RXC Flag can be used to generate a Receive Complete interrupt (see description of the RXCIE bit).
*/
#define RXC 	7
/*
** TXC: USART Transmit Complete
** This flag bit is set when the entire frame in the Transmit Shift Register has been shifted out and there are no new data currently 
** present in the transmit buffer (UDR). The TXC Flag bit is automatically cleared when a transmit complete interrupt is executed, 
** or it can be cleared by writing a one to its bit location. The TXC Flag can generate a Transmit Complete interrupt 
** (see description of the TXCIE bit).
*/
#define TXC 	6
/*
** UDRE: USART Data Register Empty
** The UDRE Flag indicates if the transmit buffer (UDR) is ready to receive new data. If UDRE is one, the buffer is empty, 
** and therefore ready to be written. The UDRE Flag can generate a Data Register Empty interrupt (see description of the UDRIE bit).
** UDRE is set after a reset to indicate that the Transmitter is ready.
*/
#define UDRE 	5
/*
** FE: Frame Error
** This bit is set if the next character in the receive buffer had a Frame Error when received 
** (i.e., when the first stop bit of the next character in the receive buffer is zero). 
** This bit is valid until the receive buffer (UDR) is read. The FE bit is zero when the stop bit of received data is one. 
** Always set this bit to zero when writing to UCSRA.
*/
#define FE 		4
/*
** DOR: Data OverRun
** This bit is set if a Data OverRun condition is detected. A Data OverRun occurs when the receive buffer is full (two characters), 
** it is a new character waiting in the Receive Shift Register, and a new start bit is detected. 
** This bit is valid until the receive buffer (UDR) is read. Always set this bit to zero when writing to UCSRA.
*/
#define DOR 	3
/*
** PE: Parity Error
** This bit is set if the next character in the receive buffer had a Parity Error when received and the parity checking was enabled at 
** that point (UPM1 = 1). This bit is valid until the receive buffer (UDR) is read. Always set this bit to zero when writing to UCSRA.
*/
#define PE 		2
/*
** U2X: Double the USART Transmission Speed
** This bit only has effect for the asynchronous operation. Write this bit to zero when using synchronous operation.
** Writing this bit to one will reduce the divisor of the baud rate divider from 16 to 8 effectively doubling the transfer rate for 
** asynchronous communication.
*/
#define U2X 	1
/*
** MPCM: Multi-processor Communication Mode
** This bit enables the Multi-processor Communication mode. When the MPCM bit is written to one, all the incoming frames received by 
** the USART Receiver that do not contain address information will be ignored. The Transmitter is unaffected by the MPCM setting.
*/
#define MPCM	0
/*
** UCSRB – USART Control and Status Register B
*/
#define UCSRB	*(volatile U8 *const)0x2A
/*
** RXCIE: RX Complete Interrupt Enable
** Writing this bit to one enables interrupt on the RXC Flag. A USART Receive Complete interrupt will be generated only if 
** the RXCIE bit is written to one, the Global Interrupt Flag in SREG is written to one and the RXC bit in UCSRA is set.
*/
#define RXCIE 	7
/*
** TXCIE: TX Complete Interrupt Enable
** Writing this bit to one enables interrupt on the TXC Flag. A USART Transmit Complete interrupt will be generated only if 
** the TXCIE bit is written to one, the Global Interrupt Flag in SREG is written to one and the TXC bit in UCSRA is set.
*/
#define TXCIE 	6
/*
** UDRIE: USART Data Register Empty Interrupt Enable
** Writing this bit to one enables interrupt on the UDRE Flag. A Data Register Empty interrupt will be generated only if the UDRIE 
** bit is written to one, the Global Interrupt Flag in SREG is written to one and the UDRE bit in UCSRA is set.
*/
#define UDRIE 	5
/*
** RXEN: Receiver Enable
** Writing this bit to one enables the USART Receiver. The Receiver will override normal port operation for the RxD pin when enabled. 
** Disabling the Receiver will flush the receive buffer invalidating the FE, DOR and PE Flags.
*/
#define RXEN 	4
/*
** TXEN: Transmitter Enable
** Writing this bit to one enables the USART Transmitter. The Transmitter will override normal port operation for the TxD pin when enabled. 
** The disabling of the Transmitter (writing TXEN to zero) will not become effective until ongoing and pending transmissions are completed 
** (i.e., when the Transmit Shift Register and Transmit Buffer Register do not contain data to be transmitted). 
** When disabled, the Transmitter will no longer override the TxD port.
*/
#define TXEN 	3
/*
** UCSZ2: Character Size
** The UCSZ2 bits combined with the UCSZ1:0 bit in UCSRC sets the number of data bits (Character Size) in a frame the Receiver and 
** Transmitter use.
*/
#define UCSZ2 	2
/*
** RXB8: Receive Data Bit 8
** RXB8 is the ninth data bit of the received character when operating with serial frames with nine data bits. Must be read before reading 
** the low bits from UDR.
*/
#define RXB8 	1
/*
** TXB8: Transmit Data Bit 8
** TXB8 is the ninth data bit in the character to be transmitted when operating with serial frames with nine data bits. 
** Must be written before writing the low bits to UDR.
*/
#define TXB8	0

