keroles/Embedded_System/Embedded_System/Projects_solutiones/LED_MATRIX/AhmedRagabShaarawy/ledMatrix5x7/ledMatrix1/atmega32_MCAL/atmega32_lib.h
/*
** UCSRC – USART Control and Status Register C
*/
#define UCSRC	*(volatile U8 *const)0x40
/*
** URSEL: Register Select
** This bit selects between accessing the UCSRC or the UBRRH Register. It is read as one when reading UCSRC. 
** The URSEL must be one when writing the UCSRC.
*/
#define URSEL 	7
/*
** UMSEL: Mode Select
** This bit selects between Asynchronous and Synchronous mode of operation.
** UMSEL Bit Settings: UMSEL= 0 >> Asynchronous Operation mode	, UMSEL= 1 >> Synchronous Operation.
*/
#define UMSEL 	6
/*
** UPMn: Parity Mode [n = 1:0]
** These bits enable and set type of Parity Generation and Check. If enabled, the Transmitter will automatically generate and 
** send the parity of the transmitted data bits within each frame. The Receiver will generate a parity value for the incoming data and 
** compare it to the UPM0 setting. If a mismatch is detected, the PE Flag in UCSRA will be set. UPM Bits Settings:
** UPM1, UPM0 = { 0 0: Disabled
				  0 1: Reserved
				  1 0: Enabled, Even Parity
				  1 1: Enabled, Odd Parity }.
*/
#define UPM1 	5
#define UPM0 	4
/*
** USBS: Stop Bit Select
** This bit selects the number of stop bits to be inserted by the Transmitter. The Receiver ignores this setting.
** USBS= 0 >> stop-bits= 1-bit, USBS= 1 >> stop-bits= 2-bit.
*/
#define USBS 	3
/*
** UCSZn: Character Size [n = 1:0]
** The UCSZ1:0 bits combined with the UCSZ2 bit in UCSRB sets the number of data bits (Character Size) in a frame the Receiver and 
** Transmitter use. UCSZ Bits Settings:
** UCSZ2, UCSZ1, UCSZ0 = { 0 0 0: 5-bit
				  		   0 0 1: 6-bit
				 		   0 1 0: 7-bit
				  		   0 1 1: 8-bit
				 		   1 0 0: Reserved
				 		   1 0 1: Reserved
				 		   1 1 0: Reserved
				 		   1 1 1: 9-bit }.
*/
#define UCSZ1 	2
#define UCSZ0 	1
/*
** UCPOL: Clock Polarity
** This bit is used for Synchronous mode only. Write this bit to zero when Asynchronous mode is used. 
** The UCPOL bit sets the relationship between data output change and data input sample, and the synchronous clock (XCK). UCPOL Bit Settings:
** UCPOL= 0 >> Transmitted Data Changed (Output of TxD Pin)= Rising XCK Edge,  Received Data Sampled (Input on RxD Pin)= Falling XCK Edge.
** UCPOL= 1 >> Transmitted Data Changed (Output of TxD Pin)= Falling XCK Edge, Received Data Sampled (Input on RxD Pin)= Rising XCK Edge.
*/
#define UCPOL	0
/*
** UBRRL – USART Baud Rate Register Low
*/
#define UBRRL	*(volatile U8 *const)0x29
/* 
** UBBR[7:0]: USART Baud Rate Register
** This is a 12-bit register which contains the USART baud rate. The UBRRH contains the four most significant bits, 
** and the UBRRL contains the eight least significant bits of the USART baud rate. Ongoing transmissions by the Transmitter and 
** Receiver will be corrupted if the baud rate is changed. Writing UBRRL will trigger an immediate update of the baud rate prescaler.
*/
/*
** UBBRH – USART Baud Rate Register High
** UBRR[3:0]: USART Baud Rate Register [n = 11:8].
*/
/*
			       ************************************
******************************** TWI - Two-wire Serial Interface  ******************************
			       ************************************
*/
/* 
** TWBR – TWI Bit Rate Register
*/
#define TWBR	*(volatile U8 *const)0x20
#define TWBR7 	7
#define TWBR6 	6
#define TWBR5 	5
#define TWBR4 	4
#define TWBR3 	3
#define TWBR2 	2
#define TWBR1 	1
#define TWBR0	0


/*
** TWCR – TWI Control Register
*/
#define TWCR	*(volatile U8 *const)0x56
#define TWINT 	7
#define TWEA 	6
#define TWSTA 	5
#define TWSTO 	4
#define TWWC 	3
#define TWEN 	2
#define TWIE	0


/*
** TWSR – TWI Status Register
*/
#define TWSR	*(volatile U8 *const)0x21
#define TWS4 	7
#define TWS3 	6
#define TWS2 	5
#define TWS1 	4
#define TWS0	3
#define TWPS1 	1
#define TWPS0	0


/*
** TWDR – TWI Data Register
*/
#define TWDR	*(volatile U8 *const)0x23
#define TWD7 	7
#define TWD6	6
#define TWD5 	5
#define TWD4 	4
#define TWD3 	3	
#define TWD2 	2
#define TWD1 	1
#define TWD0	0

/*
** TWAR – TWI (Slave) Address Register
*/
#define TWAR	*(volatile U8 *const)0x22
#define TWA6 	7
#define TWA5 	6
#define TWA4 	5
#define TWA3 	4
#define TWA2 	3
#define TWA1 	2
#define TWA0 	1
#define TWGCE	0


#endif
